; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v3)
             (pred_8 ?v1 ?v11)
             (pred_4 ?v5 ?v11)
             (pred_6 ?v7 ?v5 )
	     (pred_7 ?v5)
             (pred_12 ?v10)
             (pred_11 ?v1)
             (pred_3 ?v11)
             (pred_5 ?v5)
             (pred_10 ?v1)
             (pred_1 ?v5)
             (pred_2 ))



(:action op_4
:parameters (?v2 ?v9 ?v12 ?v4)
:precondition (and (pred_12 ?v2) (pred_12 ?v9) (pred_11 ?v12) (pred_3 ?v4)
          (pred_9 ?v2 ?v9) (pred_8 ?v12 ?v4)
                   (pred_4 ?v9 ?v4) (pred_7 ?v2) 
                   (pred_5 ?v9) (pred_10 ?v12))
:effect (and  (pred_1 ?v9) (not (pred_5 ?v9))))


(:action op_1
:parameters (?v2 ?v6)
:precondition (and (pred_12 ?v2) (pred_12 ?v6)
               (pred_7 ?v2) (pred_9 ?v2 ?v6) (pred_1 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v2))))

(:action op_5
:parameters (?v2 ?v12)
:precondition (and (pred_12 ?v2) (pred_11 ?v12) 
                  (pred_7 ?v2) (pred_6 ?v12 ?v2) (pred_2 ))
:effect (and (pred_10 ?v12)
   (not (pred_6 ?v12 ?v2)) (not (pred_2 ))))


(:action op_2
:parameters (?v2 ?v13 ?v8)
:precondition (and (pred_12 ?v2) (pred_11 ?v13) (pred_11 ?v8)
                  (pred_7 ?v2) (pred_10 ?v8) (pred_6 ?v13 ?v2))
:effect (and (pred_10 ?v13) (pred_6 ?v8 ?v2)
        (not (pred_10 ?v8)) (not (pred_6 ?v13 ?v2))))

(:action op_3
:parameters (?v2 ?v12)
:precondition (and (pred_12 ?v2) (pred_11 ?v12) 
                  (pred_7 ?v2) (pred_10 ?v12))
:effect (and (pred_2 ) (pred_6 ?v12 ?v2) (not (pred_10 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_10 obj_30 obj_23 obj_22 obj_09 obj_21 obj_26 obj_17 obj_15 obj_05 obj_06 obj_20 obj_27 obj_24 obj_13 obj_03 obj_07 obj_28 obj_04 obj_01 obj_16 obj_11 obj_25 obj_18
    obj_19 obj_29
    obj_08 obj_02 obj_12
    )

    (:init
       (pred_2)

       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_30)
       (pred_12 obj_23)
       (pred_12 obj_22)
       (pred_12 obj_09)
       (pred_12 obj_21)
       (pred_12 obj_26)
       (pred_12 obj_17)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_27)
       (pred_12 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_07)
       (pred_12 obj_28)
       (pred_12 obj_04)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_12 obj_11)
       (pred_12 obj_25)
       (pred_12 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_29)
       (pred_11 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_12)

       (pred_9 obj_14 obj_09)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_10 obj_21)
       (pred_9 obj_10 obj_30)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_30 obj_26)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_10)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_23 obj_22)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_22 obj_15)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_21)
       (pred_9 obj_09 obj_14)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_21 obj_26)
       (pred_9 obj_21 obj_10)
       (pred_9 obj_21 obj_09)
       (pred_9 obj_26 obj_20)
       (pred_9 obj_26 obj_17)
       (pred_9 obj_26 obj_30)
       (pred_9 obj_26 obj_21)
       (pred_9 obj_17 obj_27)
       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_17 obj_26)
       (pred_9 obj_15 obj_24)
       (pred_9 obj_15 obj_22)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_06)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_26)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_27 obj_28)
       (pred_9 obj_27 obj_24)
       (pred_9 obj_27 obj_17)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_24 obj_04)
       (pred_9 obj_24 obj_15)
       (pred_9 obj_24 obj_27)
       (pred_9 obj_13 obj_01)
       (pred_9 obj_13 obj_03)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_03 obj_16)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_13)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_28 obj_04)
       (pred_9 obj_28 obj_27)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_04 obj_18)
       (pred_9 obj_04 obj_24)
       (pred_9 obj_04 obj_28)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_03)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_11 obj_25)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_25 obj_18)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_25 obj_11)
       (pred_9 obj_18 obj_04)
       (pred_9 obj_18 obj_25)
       (pred_5 obj_30)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_4  obj_30 obj_19)
       (pred_4  obj_01 obj_29)
       (pred_4  obj_28 obj_29)
       (pred_1 obj_14)
       (pred_1 obj_10)
       (pred_1 obj_23)
       (pred_1 obj_22)
       (pred_1 obj_09)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_17)
       (pred_1 obj_15)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_27)
       (pred_1 obj_24)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_1 obj_04)
       (pred_1 obj_16)
       (pred_1 obj_11)
       (pred_1 obj_25)
       (pred_1 obj_18)

       (pred_8  obj_08 obj_19)
       (pred_8  obj_02 obj_29)
       (pred_8  obj_12 obj_19)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_02 obj_26)
       (pred_6 obj_12 obj_23)
       (pred_7 obj_17)
    )

    (:goal (and
       (pred_6 obj_02 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_21)))
)
)

; plan
1. (op_1 obj_17 obj_26)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_26)
   goals met: 0 of 1
2. (op_5 obj_26 obj_02)
   deleted: (pred_6 obj_02 obj_26) (pred_2)
   added: (pred_10 obj_02)
   goals met: 0 of 1
3. (op_1 obj_26 obj_20)
   deleted: (pred_7 obj_26)
   added: (pred_7 obj_20)
   goals met: 0 of 1
4. (op_1 obj_20 obj_06)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_05)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_05)
   goals met: 0 of 1
6. (op_3 obj_05 obj_02)
   deleted: (pred_10 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_05)
   goals met: 1 of 1
